'use client'


import Link from "next/link";
import { useActionState } from "react";


import { useState } from 'react';
//import { Button } from "@/components/ui/button";

export default function Policy() {
  
 
  const item2 = ['2.1 เราได้รับข้อมูลส่วนบุคคลของท่านจากมหาวิทยาลัย ซึ่งมหาวิทยาลัยได้เก็บรวบรวมไว้', '2.2. เราได้รับข้อมูลส่วนบุคคลจากท่านโดยตรง จากการที่ท่านเข้าใช้บริการ ติดต่อ เยี่ยมชม ค้นหา ผ่านทางเว็บไซต์ อีเมล การติดต่อเจ้าหน้าที่หรือบุคลากรที่ดูแล รวมถึงช่องทางการสื่อสารอื่นๆ'];
  const item3 = ['เพื่อประโยชน์ของท่านในการใช้บริการเว็บไซต์ เราจะจัดเก็บรวบรวมข้อมูลส่วนบุคคลของท่านตามระยะเวลาเท่าที่จำเป็นต่อวัตุประสงค์ โดยวัตถุประสงค์ของการจัดเก็บข้อมูลส่วนบุคคล มีดังนี้','3.1 เพื่อยืนยันตัวตนของท่าน', '3.2. เพื่อป้องกัน ตรวจสอบ รายการต่างๆ ที่อาจจะเกิดอาชญากรรมทางคอมพิวเตอร์และการฉ้อโกง', '3.3. เพื่อวิเคราะห์ ทบทวน พัฒนา และปรับปรุงการให้บริการ', '3.4 เพื่อการประมวลข้อมูล การทำสถิติ ศึกษาและวิเคราะห์ข้อมูล', '3.5 เพื่อใช้ในการติดต่อและสอบถามข้อมูลเพิ่มเติม','3.6 เพื่อใช้ในการบันทึกรายการต่างๆ ในเว็บไซต์'];
  const item4 = ['เราจะดำเนินการจัดเก็บข้อมูลส่วนบุคคลของท่านตลอดระยะเวลาที่ท่านยังปฏิบัติหน้าที่อยู่ในวิทยาลัยฯ แต่เราอาจจะยังคงเก็บข้อมูลส่วนบุคคลของท่านต่อไปหากเห็นว่ายังมีความจำเป็นหรือตามที่กฎหมายกำหนด'];
  const item5 = ['5.1 ท่านมีสิทธิเข้าถึงข้อมูล และขอรับสำเนาข้อมูลข้อมูลส่วนบุคคลของท่าน ', '5.2. ท่านมีสิทธิในการแก้ไขข้อมูลที่เราเก็บรวบรวมไว้ ให้ถูกต้อง สมบูรณ์และเป็นปัจจุบัน ', '5.3. ท่านมีสิทธิขอให้เราแก้ไขข้อมูลที่ไม่ถูกต้อง หรือเพิ่มเติมข้อมูลที่ไม่สมบูรณ์ได้ และอาจขอให้เราลบ หรือเปิดเผยแหล่งที่มาของข้อมูลของท่านในกรณีที่ไม่ได้ให้ความยินยอมได้ ','5.4 ท่านมีสิทธิคัดค้าน หรือระงับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลบางประการของท่านได้','5.5 ท่านมีสิทธิในการเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลได้ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับเรา เว้นแต่มีข้อจำกัดสิทธิในการเพิกถอนความยินยอมโดยกฎหมาย อย่างไรก็ตาม การที่ท่านเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคล อาจส่งผลให้เรามีข้อมูลไม่เพียงพอต่อการประมวลผลให้บรรลุวัตถุประสงค์ตามที่ได้แจ้ง และท่านอาจขาดความสะดวกในการได้รับบริการจากเรา'];





  return (
    <div className="flex items-center justify-center min-h-screen bg-gray-100">
      <div className="w-full p-6 bg-white rounded-lg shadow-lg">
        
       
        <h2 className="mb-6 text-5xl font-bold font-weight: 700; text-center">นโยบายการคุ้มครองข้อมูลส่วนบุคคล (Privacy Policy)</h2>
        <h5>เราเคารพสิทธิความเป็นส่วนตัวและความปลอดภัยของข้อมูลส่วนบุคคลของท่าน ขณะที่ท่านเข้าใช้บริการเว็บไซต์นี้ เราจะจัดการ ควบคุม และรักษาข้อมูลของท่านอย่างเหมาะสม เพื่อให้ท่านมั่นใจได้ว่าข้อมูลส่วนบุคคลที่ท่านให้ไว้จะถูกนำไปใช้ตรงตามวัตถุประสงค์และถูกต้องตามกฎหมาย</h5>
        <ol style={{ listStyleType: 'decimal' }}>
        <li>การเก็บรวบรวม ใช้ และ/หรือ เปิดเผยข้อมูลส่วนบุคคล
          <ol style={{ listStyleType: 'decimal', marginLeft: '20px' }}>
            <li>1.1 ข้อมูลที่บ่งชี้ตัวตน ได้แก่ ชื่อ-นามสกุล, ตำแหน่งงาน</li>
            <li>1.2. ข้อมูลการติดต่อ ได้แก่ หมายเลขโทรศัพท์, อีเมล</li>
            <li>1.3. ข้อมูลการเข้าใช้งานเว็บไซต์ ได้แก่ ประวัติการเข้าใช้งาน, ชื่อผู้ใช้, ชนิดของบราว์เซอร์, ประวัติการทำรายการ, Cookies หรือ Session</li>
          </ol>
        </li>
        <li>เราได้รับข้อมูลส่วนบุคคลของท่านจากช่องทางใด
          <ol style={{ listStyleType: 'decimal', marginLeft: '20px' }}>
            <li>2.1 เราได้รับข้อมูลส่วนบุคคลของท่านจากมหาวิทยาลัย ซึ่งมหาวิทยาลัยได้เก็บรวบรวมไว้</li>
            <li>2.2. เราได้รับข้อมูลส่วนบุคคลจากท่านโดยตรง จากการที่ท่านเข้าใช้บริการ ติดต่อ เยี่ยมชม ค้นหา ผ่านทางเว็บไซต์ อีเมล การติดต่อเจ้าหน้าที่หรือบุคลากรที่ดูแล รวมถึงช่องทางการสื่อสารอื่นๆ</li>
          </ol>
        </li>
        <li>วัตถุประสงค์ของการเก็บรวบรวม ใช้ และ/หรือ เปิดเผยข้อมูลส่วนบุคคล
          <ol style={{ listStyleType: 'decimal', marginLeft: '20px' }}>
            <h5>เพื่อประโยชน์ของท่านในการใช้บริการเว็บไซต์ เราจะจัดเก็บรวบรวมข้อมูลส่วนบุคคลของท่านตามระยะเวลาเท่าที่จำเป็นต่อวัตุประสงค์ โดยวัตถุประสงค์ของการจัดเก็บข้อมูลส่วนบุคคล มีดังนี้</h5>
            <li>3.1 เพื่อยืนยันตัวตนของท่าน</li>
            <li>3.2. เพื่อป้องกัน ตรวจสอบ รายการต่างๆ ที่อาจจะเกิดอาชญากรรมทางคอมพิวเตอร์และการฉ้อโกง</li>
            <li>3.3. เพื่อวิเคราะห์ ทบทวน พัฒนา และปรับปรุงการให้บริการ</li>
            <li>3.4 เพื่อการประมวลข้อมูล การทำสถิติ ศึกษาและวิเคราะห์ข้อมูล</li>
            <li>3.5 เพื่อใช้ในการติดต่อและสอบถามข้อมูลเพิ่มเติม</li>
            <li>3.6 เพื่อใช้ในการบันทึกรายการต่างๆ ในเว็บไซต์</li>

          </ol>
        </li>
        <li>ระยะเวลาในการจัดเก็บข้อมูล
          <ol style={{ listStyleType: 'decimal', marginLeft: '20px' }}>
            <h5>เราจะดำเนินการจัดเก็บข้อมูลส่วนบุคคลของท่านตลอดระยะเวลาที่ท่านยังปฏิบัติหน้าที่อยู่ในวิทยาลัยฯ แต่เราอาจจะยังคงเก็บข้อมูลส่วนบุคคลของท่านต่อไปหากเห็นว่ายังมีความจำเป็นหรือตามที่กฎหมายกำหนด</h5>
          </ol>
        </li>
        <li>สิทธิเกี่ยวกับข้อมูลส่วนบุคคลของท่าน
          <ol style={{ listStyleType: 'decimal', marginLeft: '20px' }}>
            <li>5.1 ท่านมีสิทธิเข้าถึงข้อมูล และขอรับสำเนาข้อมูลข้อมูลส่วนบุคคลของท่าน </li>
            <li>5.2. ท่านมีสิทธิในการแก้ไขข้อมูลที่เราเก็บรวบรวมไว้ ให้ถูกต้อง สมบูรณ์และเป็นปัจจุบัน </li>
            <li>5.3. ท่านมีสิทธิขอให้เราแก้ไขข้อมูลที่ไม่ถูกต้อง หรือเพิ่มเติมข้อมูลที่ไม่สมบูรณ์ได้ และอาจขอให้เราลบ หรือเปิดเผยแหล่งที่มาของข้อมูลของท่านในกรณีที่ไม่ได้ให้ความยินยอมได้ </li>
            <li>5.4 ท่านมีสิทธิคัดค้าน หรือระงับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลบางประการของท่านได้</li>
            <li>5.5 ท่านมีสิทธิในการเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลได้ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับเรา เว้นแต่มีข้อจำกัดสิทธิในการเพิกถอนความยินยอมโดยกฎหมาย อย่างไรก็ตาม การที่ท่านเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคล อาจส่งผลให้เรามีข้อมูลไม่เพียงพอต่อการประมวลผลให้บรรลุวัตถุประสงค์ตามที่ได้แจ้ง และท่านอาจขาดความสะดวกในการได้รับบริการจากเรา</li>
          </ol>
        </li>
      </ol>
       
        <h5>ท่านสามารถดูรายละเอียดเพิ่มเติมเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคลของมหาวิทยาลัยศรีนครินทรวิโรฒ ได้ที่ <Link href="https://pdpa.swu.ac.th/">pdpa.swu.ac.th</Link></h5>
        <h5>ระบบเก็บข้อมูล KPI วิทยาลัยนวัตกรรมสื่อสารสังคม มหาวิทยาลัยศรีนครินทรวิโรฒ</h5>

        <Link href="/auth/registration" className="px-4 py-2 text-white transition duration-300 bg-red-500 rounded hover:bg-red-200">Prev</Link> 
        <Link href="/auth/login" className="px-4 py-2 text-white transition duration-300 bg-red-500 rounded hover:bg-red-200">Next</Link>
      </div>
    </div>
  );
}